__author__ = 'alex'

# Устранение левой рекурсии.
# Постройте программу, которая в качестве входа принимает приведенную КС-грамматику G и
# преобразует ее в эквивалентную КС-грамматику G' без левой рекурсии.
# Указания.
# 1) Проработать самостоятельно п. 4.3.3. и п. 4.3.4. [2].
# 2) Воспользоваться алгоритмом 2.13. При тестировании воспользоваться примером 2.27. [1].
# 3) Воспользоваться алгоритмами 4.8 и 4.10. При тестировании воспользоваться примерами 4.7., 4.9. и
# 4.11. [2].
# 4) Устранять надо не только непосредственную (immediate), но и косвенную (indirect) рекурсию. Этот
# вопрос подробно затронут в [4].
# 5) После устранения левой рекурсии можно применить левую факторизацию.


